In [1]:
import pandas as pd

### 1. Read file csv from URL

In [2]:
df=pd.read_csv("https://raw.githubusercontent.com/yinghaoz1/tmdb-movie-dataset-analysis/master/tmdb-movies.csv")

### 2. Sort movies by release date

In [3]:
df['release_date']=pd.to_datetime(df['release_date'],format='%m/%d/%y',errors='coerce')
df.loc[df['release_date'].dt.year>2025,'release_date']-=pd.DateOffset(years=100)
df_sort_release_date = df.sort_values(by="release_date", ascending=False)
df_sort_release_date.to_csv("df_sort_relear_date.csv",index=False)

### 3. Find list movies with rating above 7.5

In [4]:
df_rating_above_75=df.loc[df['vote_average']>7.5].sort_values(by='vote_average', ascending=False)
df_rating_above_75.to_csv("df_rating_above_75.csv",index=False)

### 4. Find the highest & lowest revenue movie

In [5]:
#top_revenue_movie
df.loc[df['revenue']==df['revenue'].max()][['original_title','revenue']]

     original_title     revenue
1386         Avatar  2781505847

In [6]:
#low_revenue_movie
df.loc[df['revenue']==df['revenue'].min()][['original_title','revenue']]

                       original_title  revenue
48                          Wild Card        0
67                           Survivor        0
74             Mythica: The Darkspore        0
75     Me and Earl and the Dying Girl        0
92           Mythica: The Necromancer        0
...                               ...      ...
10861              The Endless Summer        0
10862                      Grand Prix        0
10863             Beregis Avtomobilya        0
10864          What's Up, Tiger Lily?        0
10865        Manos: The Hands of Fate        0

[6016 rows x 2 columns]

### 5. Caculate total revenue of all movies

In [7]:
#Total Revenue
total_revenue=df['revenue'].sum()
print("Total revenue of all movies: ${:,}".format(total_revenue))

Total revenue of all movies: $432,720,192,875

### 6. Find top 10 profit movies

In [8]:
#find 10 profit movies
df['profit']=df['revenue']-df['budget']
top_10_profit= df.nlargest(10,'profit')[['original_title','profit','revenue','budget']].sort_values(by='profit', ascending=False)
top_10_profit

,original_title,profit,revenue,budget
1386,Avatar,2544505847,2781505847,237000000
3,Star Wars: The Force Awakens,1868178225,2068178225,200000000
5231,Titanic,1645034188,1845034188,200000000
0,Jurassic World,1363528810,1513528810,150000000
4,Furious 7,1316249360,1506249360,190000000
4361,The Avengers,1299557910,1519557910,220000000
3374,Harry Potter and the Deathly Hallows: Part 2,1202817822,1327817822,125000000
14,Avengers: Age of Ultron,1125035767,1405035767,280000000
5422,Frozen,1124219009,1274219009,150000000
8094,The Net,1084279658,1106279658,22000000

### 7.1 Director with most movies

In [9]:
df.groupby('director', as_index=False)['id'].nunique().rename(columns={'id':'total_movies'}).nlargest(1,'total_movies')

         director  total_movies
4999  Woody Allen            45

### 7.2 Actors with most movies

In [10]:
df['cast'].str.split('|').explode().value_counts().reset_index(name='total_movies').nlargest(1, 'total_movies')

             cast  total_movies
0  Robert De Niro            72

### 8. Find number of movies per genres

In [11]:
df['genres'].str.split('|').explode().value_counts().reset_index(name='total_movies')

             genres  total_movies
0             Drama          4761
1            Comedy          3793
2          Thriller          2908
3            Action          2385
4           Romance          1712
5            Horror          1637
6         Adventure          1471
7             Crime          1355
8            Family          1231
9   Science Fiction          1230
10          Fantasy           916
11          Mystery           810
12        Animation           699
13      Documentary           520
14            Music           408
15          History           334
16              War           270
17          Foreign           188
18         TV Movie           167
19          Western           165